[
    {
        "company": "Healthcare IQ",
        "location": "Palmetto, FL",
        "dateRange": "4/2019 — Present",
        "summary": "",
        "positions": [
            {
                "title": "Full Stack Software Engineer",
                "dateRange": "4/2019 — Present",
                "bullets": [
                    "Primary UI/UX developer responsible for design, new features, and bug fixes for a customer-facing Angular 9 application.",
                    "Implements new solutions from front-end to back-end, utilizing technologies such as Angular, Docker, Java, NodeJS, and Java.",
                    "Collaborates with and mentors fellow software engineers on a variety of projects."
                ]
            }
        ]
    },
    {
        "company": "SRI International",
        "location": "St. Petersburg, FL",
        "dateRange": "9/2015 — 4/2019",
        "summary": "",
        "positions": [
            {
                "title": "Software Engineer",
                "dateRange": "8/2016 — 4/2019",
                "bullets": [
                    "Hired on through the University of South Florida’s cooperative education program after two successful semesters.",
                    "Designed (wireframes and mockups) and implemented web apps from start to finish.",
                    "Enhanced a production system's UI with new features and performance improvements, augmenting operator workflows.",
                    "Added new and impactful capabilities to a mature service-oriented architecture using Java.",
                    "Coordinated internal software releases among team members for testing and expediting bug fixes. Clients received new software releases roughly every month as a result."
                ]
            },
            {
                "title": "Student Associate",
                "dateRange": "9/2015 — 12/2015, 5/2016 — 8/2016",
                "bullets": [
                    "Contributed to a successful technical demonstration, resulting in additional funding for a project.",
                    "Developed a UI feature improvement in Javascript that enhanced the user friendliness of a system.",
                    "Prepared documentation and slides for various projects, of which one was made an internal standard for an SRI capability."
                ]
            }
        ]
    }
]