[
    {
        "company": "SRI International",
        "location": "St. Petersburg, FL",
        "dateRange": "9/2015 — 4/2019",
        "summary": "Initially hired on as a Student Associate for two semesters through the cooperative education program at the University of South Florida. Shadowed a senior software engineer and created goals to work towards. Transitioned to full-time employment after graduation and received a promotion in recognition of outstanding performance as a Student Associate. Took on higher level developer responsibilities and continued to set goals with technical leads to deliver quality results and further professional development.",
        "positions": [
            {
                "title": "Software Engineer",
                "dateRange": "8/2016 — 4/2019",
                "bullets": [
                    "Designed (wireframes and mockups) and implemented web apps from start to finish.",
                    "Enhanced a production system's UI with new features and performance improvements augmenting operator workflows.",
                    "Added new impactful capabilities to a mature Service-Oriented Architecture using Java",
                    "Coordinated internal software releases among team members for testing and expediting bug fixes. Clients received new software releases roughly every month as a result.",
                    "Engaged in meetings and scrums to gauge tasking priorities, ask questions, and offer suggestions for new features and improvements.",
                    "Contributed new ideas for proposals and technical breakdowns for white papers."
                ]
            },
            {
                "title": "Student Associate",
                "dateRange": "9/2015 — 12/2015, 5/2016 — 8/2016",
                "bullets": [
                    "Contributed to a successful technical demonstration, resulting in additional funding for a project.",
                    "Developed a UI feature improvement in Javascript that enhanced the user friendliness of a system.",
                    "Prepared documentation and slides for various projects, of which one was made an internal standard for an SRI capability."
                ]
            }
        ]
    }
]